Revit 2027 API
HVACLoadType.PowerLoadDensity Property
 The power load density.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PowerLoadDensity { get; set; }
Public Property PowerLoadDensity As Double
	Get
	Set
public:
property double PowerLoadDensity {
	double get ();
	void set (double value);
}
member PowerLoadDensity : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The value should be between [0.0,500000.0].
See Also
Reference
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace